; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-3-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-1 - location
	p0-2 - location
	p1-3 - location
	p1-11 - location
	p2-8 - location
	p2-11 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p3-5 - location
	p3-12 - location
	p4-0 - location
	p4-6 - location
	p4-8 - location
	p4-11 - location
	p5-9 - location
	p6-2 - location
	p6-10 - location
	p8-0 - location
	p9-0 - location
	p9-8 - location
	p9-11 - location
	p10-6 - location
	p11-5 - location
	p12-7 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s4)
	(at driver4 s0)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s6)
	(at package2 s8)
	(at package3 s9)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-11)
	(path p1-11 s1)
	(path s11 p1-11)
	(path p1-11 s11)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s2 p2-11)
	(path p2-11 s2)
	(path s11 p2-11)
	(path p2-11 s11)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-12)
	(path p3-12 s3)
	(path s12 p3-12)
	(path p3-12 s12)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-10)
	(path p6-10 s6)
	(path s10 p6-10)
	(path p6-10 s10)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(path s9 p9-11)
	(path p9-11 s9)
	(path s11 p9-11)
	(path p9-11 s11)
	(path s11 p11-5)
	(path p11-5 s11)
	(path s5 p11-5)
	(path p11-5 s5)
	(path s12 p12-7)
	(path p12-7 s12)
	(path s7 p12-7)
	(path p12-7 s7)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 85)
	(= (time-to-drive s4 s0) 85)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 19)
	(= (time-to-drive s2 s1) 19)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 60)
	(= (time-to-drive s6 s1) 60)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 18)
	(= (time-to-drive s0 s2) 18)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 56)
	(= (time-to-drive s3 s2) 56)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 94)
	(= (time-to-drive s5 s2) 94)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 20)
	(= (time-to-drive s6 s2) 20)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 48)
	(= (time-to-drive s7 s2) 48)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 93)
	(= (time-to-drive s10 s2) 93)
	(link s2 s12)
	(link s12 s2)
	(= (time-to-drive s2 s12) 30)
	(= (time-to-drive s12 s2) 30)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 5)
	(= (time-to-drive s1 s3) 5)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 10)
	(= (time-to-drive s4 s3) 10)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 21)
	(= (time-to-drive s6 s3) 21)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 38)
	(= (time-to-drive s10 s3) 38)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 58)
	(= (time-to-drive s1 s5) 58)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 53)
	(= (time-to-drive s4 s5) 53)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 69)
	(= (time-to-drive s11 s5) 69)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 54)
	(= (time-to-drive s12 s5) 54)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 65)
	(= (time-to-drive s0 s7) 65)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 74)
	(= (time-to-drive s8 s7) 74)
	(link s7 s12)
	(link s12 s7)
	(= (time-to-drive s7 s12) 17)
	(= (time-to-drive s12 s7) 17)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 86)
	(= (time-to-drive s2 s8) 86)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 30)
	(= (time-to-drive s3 s8) 30)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 84)
	(= (time-to-drive s1 s9) 84)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 96)
	(= (time-to-drive s4 s9) 96)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 34)
	(= (time-to-drive s6 s9) 34)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 61)
	(= (time-to-drive s8 s9) 61)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 93)
	(= (time-to-drive s12 s10) 93)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 39)
	(= (time-to-drive s4 s11) 39)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 53)
	(= (time-to-drive s7 s11) 53)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 95)
	(= (time-to-drive s9 s11) 95)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 24)
	(= (time-to-drive s12 s11) 24)
	(link s12 s0)
	(link s0 s12)
	(= (time-to-drive s12 s0) 71)
	(= (time-to-drive s0 s12) 71)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s10)
	(at driver4 s12)
	(at truck1 s2)
	(at truck2 s6)
	(at truck3 s9)
	(at package1 s8)
	(at package2 s2)
	(at package3 s3)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver4 truck1 s0)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 0 of 10
2. (drive-truck truck1 s0 s2 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 180
   goals met: 1 of 10
3. (drive-truck truck1 s2 s6 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 180 to 380
   goals met: 0 of 10
4. (load-truck package1 truck1 s6)
   deleted: (at package1 s6)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 0 of 10
5. (walk driver3 s4 p4-6)
   deleted: (at driver3 s4)
   added: (at driver3 p4-6)
   goals met: 0 of 10
6. (walk driver3 p4-6 s6)
   deleted: (at driver3 p4-6)
   added: (at driver3 s6)
   goals met: 0 of 10
7. (walk driver3 s6 p6-10)
   deleted: (at driver3 s6)
   added: (at driver3 p6-10)
   goals met: 0 of 10
8. (walk driver3 p6-10 s10)
   deleted: (at driver3 p6-10)
   added: (at driver3 s10)
   goals met: 1 of 10
9. (drive-truck truck1 s6 s2 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (fuel-used) from 380 to 600
   goals met: 2 of 10
10. (drive-truck truck1 s2 s8 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (fuel-used) from 600 to 1546
   goals met: 1 of 10
11. (load-truck package2 truck1 s8)
   deleted: (at package2 s8)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 10
12. (unload-truck package1 truck1 s8)
   deleted: (in package1 truck1)
   added: (at package1 s8)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 2 of 10
13. (drive-truck truck1 s8 s2 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   changed: (fuel-used) from 1546 to 2492
   goals met: 3 of 10
14. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 4 of 10
15. (drive-truck truck1 s2 s1 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 2492 to 2682
   goals met: 3 of 10
16. (disembark-truck driver4 truck1 s1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 3 of 10
17. (walk driver2 s2 p2-11)
   deleted: (at driver2 s2)
   added: (at driver2 p2-11)
   goals met: 3 of 10
18. (walk driver1 s2 p3-2)
   deleted: (at driver1 s2)
   added: (at driver1 p3-2)
   goals met: 3 of 10
19. (board-truck driver4 truck3 s1)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 3 of 10
20. (walk driver1 p3-2 s3)
   deleted: (at driver1 p3-2)
   added: (at driver1 s3)
   goals met: 3 of 10
21. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   goals met: 3 of 10
22. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   goals met: 4 of 10
23. (walk driver2 p2-11 s11)
   deleted: (at driver2 p2-11)
   added: (at driver2 s11)
   goals met: 4 of 10
24. (walk driver2 s11 p4-11)
   deleted: (at driver2 s11)
   added: (at driver2 p4-11)
   goals met: 4 of 10
25. (walk driver2 p4-11 s4)
   deleted: (at driver2 p4-11)
   added: (at driver2 s4)
   goals met: 5 of 10
26. (drive-truck truck3 s1 s9 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s9)
   changed: (fuel-used) from 2682 to 3522
   goals met: 6 of 10
27. (load-truck package3 truck3 s9)
   deleted: (at package3 s9)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 10
28. (drive-truck truck3 s9 s1 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   changed: (fuel-used) from 3522 to 4446
   goals met: 5 of 10
29. (drive-truck truck3 s1 s3 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (fuel-used) from 4446 to 4501
   goals met: 5 of 10
30. (unload-truck package3 truck3 s3)
   deleted: (in package3 truck3)
   added: (at package3 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 10
31. (drive-truck truck3 s3 s1 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (fuel-used) from 4501 to 4551
   goals met: 6 of 10
32. (disembark-truck driver4 truck3 s1)
   deleted: (driving driver4 truck3)
   added: (at driver4 s1) (empty truck3)
   goals met: 6 of 10
33. (board-truck driver4 truck1 s1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 6 of 10
34. (drive-truck truck1 s1 s2 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 4551 to 4741
   goals met: 7 of 10
35. (drive-truck truck1 s2 s12 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s12)
   changed: (fuel-used) from 4741 to 5041
   goals met: 6 of 10
36. (disembark-truck driver4 truck1 s12)
   deleted: (driving driver4 truck1)
   added: (at driver4 s12) (empty truck1)
   goals met: 7 of 10
37. (walk driver1 s4 p4-0)
   deleted: (at driver1 s4)
   added: (at driver1 p4-0)
   goals met: 6 of 10
38. (walk driver1 p4-0 s0)
   deleted: (at driver1 p4-0)
   added: (at driver1 s0)
   goals met: 6 of 10
39. (walk driver1 s0 p0-1)
   deleted: (at driver1 s0)
   added: (at driver1 p0-1)
   goals met: 6 of 10
40. (walk driver1 p0-1 s1)
   deleted: (at driver1 p0-1)
   added: (at driver1 s1)
   goals met: 6 of 10
41. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 10
42. (drive-truck truck2 s1 s6 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 5041 to 5641
   goals met: 7 of 10
43. (board-truck driver4 truck1 s12)
   deleted: (at driver4 s12) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 6 of 10
44. (disembark-truck driver1 truck2 s6)
   deleted: (driving driver1 truck2)
   added: (at driver1 s6) (empty truck2)
   goals met: 6 of 10
45. (drive-truck truck1 s12 s2 driver4)
   deleted: (at truck1 s12)
   added: (at truck1 s2)
   changed: (fuel-used) from 5641 to 5941
   goals met: 7 of 10
46. (walk driver1 s6 p4-6)
   deleted: (at driver1 s6)
   added: (at driver1 p4-6)
   goals met: 7 of 10
47. (walk driver1 p4-6 s4)
   deleted: (at driver1 p4-6)
   added: (at driver1 s4)
   goals met: 8 of 10
48. (drive-truck truck1 s2 s12 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s12)
   changed: (fuel-used) from 5941 to 6241
   goals met: 7 of 10
49. (disembark-truck driver4 truck1 s12)
   deleted: (driving driver4 truck1)
   added: (at driver4 s12) (empty truck1)
   goals met: 8 of 10
50. (walk driver1 s4 p4-0)
   deleted: (at driver1 s4)
   added: (at driver1 p4-0)
   goals met: 7 of 10
51. (walk driver1 p4-0 s0)
   deleted: (at driver1 p4-0)
   added: (at driver1 s0)
   goals met: 7 of 10
52. (board-truck driver4 truck1 s12)
   deleted: (at driver4 s12) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 6 of 10
53. (drive-truck truck1 s12 s2 driver4)
   deleted: (at truck1 s12)
   added: (at truck1 s2)
   changed: (fuel-used) from 6241 to 6541
   goals met: 7 of 10
54. (walk driver1 s0 p4-0)
   deleted: (at driver1 s0)
   added: (at driver1 p4-0)
   goals met: 7 of 10
55. (drive-truck truck1 s2 s1 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 6541 to 6731
   goals met: 6 of 10
56. (disembark-truck driver4 truck1 s1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 6 of 10
57. (board-truck driver4 truck3 s1)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 6 of 10
58. (drive-truck truck3 s1 s5 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 6731 to 7311
   goals met: 6 of 10
59. (drive-truck truck3 s5 s12 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s12)
   changed: (fuel-used) from 7311 to 7851
   goals met: 6 of 10
60. (walk driver1 p4-0 s0)
   deleted: (at driver1 p4-0)
   added: (at driver1 s0)
   goals met: 6 of 10
61. (walk driver1 s0 p0-1)
   deleted: (at driver1 s0)
   added: (at driver1 p0-1)
   goals met: 6 of 10
62. (walk driver1 p0-1 s1)
   deleted: (at driver1 p0-1)
   added: (at driver1 s1)
   goals met: 6 of 10
63. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 10
64. (drive-truck truck1 s1 s9 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s9)
   changed: (fuel-used) from 7851 to 8691
   goals met: 6 of 10
65. (drive-truck truck1 s9 s4 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (fuel-used) from 8691 to 9651
   goals met: 6 of 10
66. (drive-truck truck3 s12 s11 driver4)
   deleted: (at truck3 s12)
   added: (at truck3 s11)
   changed: (fuel-used) from 9651 to 9891
   goals met: 6 of 10
67. (drive-truck truck3 s11 s9 driver4)
   deleted: (at truck3 s11)
   added: (at truck3 s9)
   changed: (fuel-used) from 9891 to 10841
   goals met: 7 of 10
68. (disembark-truck driver4 truck3 s9)
   deleted: (driving driver4 truck3)
   added: (at driver4 s9) (empty truck3)
   goals met: 7 of 10
69. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 8 of 10
70. (walk driver4 s9 p9-11)
   deleted: (at driver4 s9)
   added: (at driver4 p9-11)
   goals met: 8 of 10
71. (board-truck driver2 truck1 s4)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 10
72. (walk driver4 p9-11 s11)
   deleted: (at driver4 p9-11)
   added: (at driver4 s11)
   goals met: 7 of 10
73. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 10841 to 11371
   goals met: 7 of 10
74. (drive-truck truck1 s5 s2 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (fuel-used) from 11371 to 12311
   goals met: 8 of 10
75. (walk driver4 s11 p4-11)
   deleted: (at driver4 s11)
   added: (at driver4 p4-11)
   goals met: 8 of 10
76. (drive-truck truck1 s2 s0 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 12311 to 12491
   goals met: 7 of 10
77. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 12491 to 13341
   goals met: 7 of 10
78. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 8 of 10
79. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 10
80. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 13341 to 14191
   goals met: 7 of 10
81. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 14191 to 14371
   goals met: 8 of 10
82. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 8 of 10
83. (walk driver1 s2 p2-11)
   deleted: (at driver1 s2)
   added: (at driver1 p2-11)
   goals met: 8 of 10
84. (walk driver1 p2-11 s11)
   deleted: (at driver1 p2-11)
   added: (at driver1 s11)
   goals met: 8 of 10
85. (walk driver1 s11 p4-11)
   deleted: (at driver1 s11)
   added: (at driver1 p4-11)
   goals met: 8 of 10
86. (walk driver1 p4-11 s4)
   deleted: (at driver1 p4-11)
   added: (at driver1 s4)
   goals met: 9 of 10
87. (walk driver4 p4-11 s4)
   deleted: (at driver4 p4-11)
   added: (at driver4 s4)
   goals met: 9 of 10
88. (walk driver4 s4 p3-4)
   deleted: (at driver4 s4)
   added: (at driver4 p3-4)
   goals met: 9 of 10
89. (walk driver4 p3-4 s3)
   deleted: (at driver4 p3-4)
   added: (at driver4 s3)
   goals met: 9 of 10
90. (walk driver4 s3 p3-12)
   deleted: (at driver4 s3)
   added: (at driver4 p3-12)
   goals met: 9 of 10
91. (walk driver4 p3-12 s12)
   deleted: (at driver4 p3-12)
   added: (at driver4 s12)
   goals met: 10 of 10
